app/controllers/bears_controller.rb

SELECT "bears".* FROM "bears"
---
  def index
    @bears = Bear.all

INSERT INTO "bears" ("name", "description", "width", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sadf"], ["description", "asdf"], ["width", 0], ["height", 0], ["created_at", "2016-02-01 16:44:28.864783"], ["updated_at", "2016-02-01 16:44:28.864783"]]
---
  def create
    @bear = Bear.new(bear_params)
    if @bear.save

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @bear = Bear.find(params[:id])

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @bear = Bear.find(params[:id])

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "bears" SET "description" = ?, "height" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["description", "asdfsfdsfdsfs"], ["height", 1212], ["updated_at", "2016-02-01 16:45:00.983338"], ["id", 5]]
---
  def update
    @bear = Bear.find(params[:id])
    if @bear.update(bear_params)

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 1]]
---
  def destroy
    @bear = Bear.find(params[:id])
    if @bear.destroy